#include <iostream>
//Вывести на экран Первую букву имени из символов "*" (звездочка)

int main() {
    std::cout << "     *" << std::endl
        << "    * *" << std::endl
        << "   *   *" << std::endl
        << "  *     *" << std::endl
        << " *       *" << std::endl;
    return 0;
}
